src/config/DataProcessors/ПечатьПрайсЛиста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<DataProcessor>
		<Properties>
			<Name>ПечатьПрайсЛиста</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БезОтсутствующихВКомпании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезПустыхЦен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВВалютеОтчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьДополнительныеПоляВОтдельнойКолонке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПрайса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостроительОтчета</Name>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрайсВидСкладовПоОстаткам</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьСтрокуОтбора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьИерархиюВЦвете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.ОтчетСписокКроссТаблица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСвойстваИКатегории</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраненныеНастройки</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаДаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтолбецДаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачатьСоСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЛиста</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаНастройкиПолейПечать</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлажокЦеныНеИзменилисьС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЦеныНеИзменились</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/config/InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/InformationRegisters/КатегорииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КатегорииОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/Catalogs/ТипыЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ТипыЦенНоменклатуры</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаЦены</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовыйТипЦен</Name>
					<Comment>(Общ) Тип цен, от которого рассчитываются цены данного типа, если не выбран, то цены задаются вручную</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рассчитывается</Name>
					<Comment>(Общ) Истина - цены автоматически рассчитываются (не хранятся) на основании цен базового типа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Comment>(Общ) Истина - цена включает НДС, ложь - не включает</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОкругления</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкруглятьВБольшуюСторону</Name>
					<Comment>(Общ) Истина, то при порядке округления "5" 0.01 будет округлена до 5, ложь - округление по арифметическим правилам</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучноеИзменение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаРассчитывается</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/config/DataProcessors/ПечатьПрайсЛиста/Ext/ObjectModule.bsl
#Если Клиент Тогда
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ
Перем мТабДок;

Перем мКоличествоТиповЦен;
Перем мКоличествоГруппировок;
Перем мКоличествоКолонокВТипеЦен;

Перем мКоличествоДопПолейПосле;
Перем мКоличествоДопПолейДо;
Перем мКоличествоДопПолейВместе;

Перем мЕстьВалюта;
Перем мЕстьЕдиница;
Перем мЕстьОстаток;
Перем мНетХарактеристик;

Перем мСоответствиеГруппировок;
Перем мСоответствиеЦветовИерархии;

Перем мСоответствиеДопПолейДо;
Перем мСоответствиеДопПолейПосле;
Перем мСоответствиеДопПолейВместе;

Перем мПустаяХарактеристика;

Перем мСписокНачало;
Перем мСписокНоменклатура;
Перем мСписокТипЦен;
Перем мСписокОстаток;
Перем мСписокДопПоле;

Перем мСписокГруппаНачало;
Перем мСписокГруппаНоменклатура;
Перем мСписокГруппаТипЦен;
Перем мСписокГруппаОстаток;
Перем мСписокГруппаДопПоле;

Перем мСписокПоложенийДляПечати Экспорт;
Перем мОсобыеПоля Экспорт;
Перем мСпециальноеПоложение Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Сохраняет настройки построителя, добавляет служебные поля, получает результат,
// восстанавливает настройки.
//
// Параметры:
//  СлужебныеПоля - структура со служебными полями.
//
// Возвращаемое значение - РезультатЗапроса.
//
Функция ВыполнитьЗапрос(СлужебныеПоля)

	Настройки = ПостроительОтчета.ПолучитьНастройки();

	Для Каждого Поле Из СлужебныеПоля Цикл
		ПостроительОтчета.ДоступныеПоля[Поле.Ключ].Поле = Истина;
		ПостроительОтчета.ВыбранныеПоля.Добавить(Поле.Ключ);
	КонецЦикла;

	ЗадатьПараметрыОтбораПоКатегориям(ПостроительОтчета, ОбщийОтчет.мСтруктураДляОтбораПоКатегориям);

	РезультатЗапроса = ПостроительОтчета.Результат;

	ПостроительОтчета.УстановитьНастройки(Настройки);

	Для Каждого Поле Из СлужебныеПоля Цикл
		ПостроительОтчета.ДоступныеПоля[Поле.Ключ].Поле = Ложь;
	КонецЦикла;

	Возврат РезультатЗапроса;

КонецФункции // ВыполнитьЗапрос()

// Обновляет таблицу с настройками вывода доп. полей на печать.
//
Процедура ОбновитьНастройкиПечати() Экспорт

	КоличествоСтрок = ТаблицаНастройкиПолейПечать.Количество() - 1;
	Для Тмп = 0 По КоличествоСтрок Цикл
		СтрокаНастройки = ТаблицаНастройкиПолейПечать[КоличествоСтрок - Тмп];
		Если ПостроительОтчета.ВыбранныеПоля.Найти(СтрокаНастройки.Имя) = Неопределено Тогда
			ТаблицаНастройкиПолейПечать.Удалить(СтрокаНастройки);
		КонецЕсли;
	КонецЦикла;

	Для Каждого Поле Из ПостроительОтчета.ВыбранныеПоля Цикл
		Если ТаблицаНастройкиПолейПечать.Найти(Поле.Имя, "Имя") = Неопределено Тогда
			НоваяСтрока = ТаблицаНастройкиПолейПечать.Добавить();
			НоваяСтрока.Поле = Поле.Представление;
			НоваяСтрока.Псевдоним = Поле.Представление;
			НоваяСтрока.ВыводитьНаПечать = Истина;
			НоваяСтрока.Имя = Поле.Имя;
			НоваяСтрока.ПутьКДанным = Поле.ПутьКДанным;

			Если мОсобыеПоля.Свойство(НоваяСтрока.Имя) Тогда
				НоваяСтрока.Положение = мОсобыеПоля[НоваяСтрока.Имя];
			Иначе
				НоваяСтрока.Положение = мСписокПоложенийДляПечати[0].Значение;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ОбновитьНастройкиПечати()

// В текст для построителя отчета вставляет свойства и категории.
// Скопирована из общего модуля и изменена.
Процедура ДобавитьВТекстСвойстваИКатегорииЛокально(ТаблицаПолей, Текст, СтруктураПредставлениеПолей, мСоответствиеНазначений, 
	                                          СтруктураПараметры, ТекстИсточникиСведений="", ТекстПоляКатегорий="", 
	                                          ТекстПоляСвойств="", ТекстПоляСгруппироватьПо = "", 
	                                          ЗаменятьСвойства = "//СВОЙСТВА", ЗаменятьКатегории = "//КАТЕГОРИИ", 
	                                          ЗаменятьСоединения = "//СОЕДИНЕНИЯ", ЗаменятьСгруппироватьПо = "//СГРУППИРОВАТЬПО",
	                                          ИдентификаторыПараметровДляОтборовПоКатегориям = "", ЗаменятьИтоги = "//ИТОГИ",
	                                          ЗаменятьПредставления = "//ПРЕДСТАВЛЕНИЯ_СВОЙСТВА") Экспорт

	// Добавляемые фрагменты запроса.
	ТекстПоляКатегорийДляГруппировки ="";
	ТекстПоляСвойствДляГруппировки = "";
	ТекстИсточникиСведений ="";
	ТекстПоляКатегорий = "";
	ТекстПоляСвойств = "";
	ТекстПоляСвойствИтоги = "";
	ТекстПоляСвойствПредставления = "";
	ТекстПоляКатегорийИтоги = "";

	Если ТипЗнч(ИдентификаторыПараметровДляОтборовПоКатегориям) <> Тип("Структура") Тогда
		ИдентификаторыПараметровДляОтборовПоКатегориям = Новый Структура;
	КонецЕсли;

	Индекс = 0;

	СвойстваОбъектов = ПланыВидовХарактеристик.СвойстваОбъектов.Выбрать();

	Пока СвойстваОбъектов.Следующий() Цикл
		Если СвойстваОбъектов.ЭтоГруппа ИЛИ СвойстваОбъектов.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;

		Поля = ТаблицаПолей.НайтиСтроки(Новый Структура("Назначение", СвойстваОбъектов.НазначениеСвойства));

		Для Каждого Поле из Поля Цикл

			// Для списка всех полей.
			ТекстПоляСвойств = ТекстПоляСвойств + ",
			|	Свойство" + Индекс + ".Значение" + " КАК " + "Свойство" + Индекс + "Значение";

			ТекстПоляСвойствИтоги = ТекстПоляСвойствИтоги + ",
			|	МИНИМУМ(Свойство" + Индекс + ".Значение)";

			ТекстПоляСвойствПредставления = ТекстПоляСвойствПредставления + ",
			|	Свойство" + Индекс + ".Значение.Представление" + " КАК " + "Свойство" + Индекс + "ЗначениеПредставление";

			ТекстПоляСвойствДляГруппировки = ТекстПоляСвойствДляГруппировки + ",
			|	Свойство" + Индекс + ".Значение";

			// Источник для свойств.
			ТекстИсточникиСведений = ТекстИсточникиСведений + Символы.ПС + 
			"{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Свойство" + Индекс + "
			|ПО Свойство" + Индекс + ".Объект = " + Поле.ПутьКДанным + "
			|И  Свойство" + Индекс + ".Свойство = &ПараметрСвойство" + Индекс + "}";

			СтруктураПараметры.Вставить("ПараметрСвойство" + Индекс, СвойстваОбъектов.Ссылка);

			СтруктураПредставлениеПолей.Вставить("Свойство" + Индекс + "Значение", СвойстваОбъектов.Наименование + " (св-во " + Поле.Представление + ")");

			мСоответствиеНазначений.Вставить(СвойстваОбъектов.Наименование + " (св-во " + Поле.Представление + ")", СвойстваОбъектов.Ссылка);

			Индекс = Индекс + 1;
		КонецЦикла;
	КонецЦикла;

	Для Каждого Строка Из ТаблицаПолей Цикл
		Если Строка.НетКатегорий <> Истина Тогда
			ТекстИсточникиСведений = ТекстИсточникиСведений + Символы.ПС + 
			"{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК Категории" + Индекс + "
			|ПО Категории" + Индекс + ".Объект = " + Строка.ПутьКДанным + "
			|И  Категории" + Индекс + ".Категория В (&ПараметрКатегории" + Индекс + ")}";

			ТекстПоляКатегорий = ТекстПоляКатегорий + ",
			|	ЕСТЬNULL(Категории" + Индекс + ".Категория , " + Строка.ПутьКДанным +
			") КАК Категории" + Индекс + "Категория";

			ТекстПоляКатегорийДляГруппировки = ТекстПоляКатегорийДляГруппировки + ",
			|	Категории" + Индекс + ".Категория";

			СтруктураПредставлениеПолей.Вставить("Категории" + Индекс + "Категория", "Категории " + Строка.Представление);

			ИдентификаторыПараметровДляОтборовПоКатегориям.Вставить("Категории" + Индекс + "Категория", "ПараметрКатегории" + Индекс);

			мСоответствиеНазначений.Вставить("Категории " + Строка.Представление, Строка.Назначение);

			Индекс = Индекс + 1;
		КонецЕсли;
	КонецЦикла;

	// ВЫБРАТЬ РАЗЛИЧНЫЕ съедает достаточно много ресурсов. Поэтому если 
	// не надо, то обойдемся без него.
	Если ТекстПоляКатегорийДляГруппировки <> "" Тогда
		Текст = СтрЗаменить(Текст, "//РАЗЛИЧНЫЕ", "РАЗЛИЧНЫЕ");
	КонецЕсли;
	
	Текст = СтрЗаменить(Текст, ЗаменятьСвойства, ТекстПоляСвойств);
	Текст = СтрЗаменить(Текст, ЗаменятьИтоги, ТекстПоляСвойствИтоги);
	Текст = СтрЗаменить(Текст, ЗаменятьПредставления, ТекстПоляСвойствПредставления);
	Текст = СтрЗаменить(Текст, ЗаменятьКатегории, ТекстПоляКатегорий);
	Текст = СтрЗаменить(Текст, ЗаменятьСоединения, ТекстИсточникиСведений);
	Текст = СтрЗаменить(Текст, ЗаменятьСгруппироватьПо, ТекстПоляСвойствДляГруппировки + ТекстПоляКатегорийДляГруппировки);

КонецПроцедуры // ДобавитьВТекстСвойстваИКатегорииЛокально()

функция получитьТекстЗапроса(ЕстьХарактеристики=ЛОЖЬ)
текстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
//РАЗЛИЧНЫЕ  +++ 04.07.2017 - НЕ НАДО! для Свойств так не работает!
|	НЕ ЕСТЬNULL(ЗапросПрайс.Номенклатура.ВестиУчетПоХарактеристикам, ИСТИНА) КАК НетХарактеристик,
|	ЗапросПрайс.ТипЦен.ПорядокОкругления КАК ПорядокОкругления,
|	ЗапросПрайс.ТипЦен.ОкруглятьВБольшуюСторону КАК ОкруглятьВБольшуюСторону,
|	ЗапросПрайс.ТипЦен,
|	ЗапросПрайс.ТипЦен.Представление КАК ТипЦенПредставление,
|	ЗапросПрайс.Номенклатура,
|	ЗапросПрайс.Номенклатура.Представление КАК НоменклатураПредставление,
// 20.08.2018
|"+?(ЕстьХарактеристики,"
|	ЗапросПрайс.ХарактеристикаНоменклатуры,
|	ЗапросПрайс.ХарактеристикаНоменклатуры.Представление КАК ХарактеристикаНоменклатурыПредставление,","")+"

|	Остатки.Остаток,
//11.08.2017 -- по задаче № 30995 добавляем "реальный" Штрих-Код
|	ЕстьNull(ШтрихКоды.ШтрихКод,"""") как ШтрихКод,
//расчетный штрих-код БЕЗ контрольного символа!  ""05000""+ЗапросПрайс.Номенклатура.Код+""_""

|	ВЫБОР КОГДА ЗапросПрайс.Цена <> 0 ТОГДА
|		ЗапросПрайс.ЕдиницаИзмерения.Представление
|	ИНАЧЕ
|		&ПустаяСтрока
|	КОНЕЦ КАК ЕдиницаИзмерения,
|	ВЫБОР КОГДА ЗапросПрайс.Цена <> 0 ТОГДА
|		ЗапросПрайс.ВалютаПрайса
|	ИНАЧЕ
|		&ПустаяСтрока
|	КОНЕЦ КАК Валюта,
|		ЗапросПрайс.Цена
|	 КАК Цена
|//СВОЙСТВА
|//ПРЕДСТАВЛЕНИЯ_СВОЙСТВА
|ИЗ
|(ВЫБРАТЬ 
|	ЦеныБазовые.ТипЦен КАК ТипЦен,
|		&ВалютаОтчета
|	КАК ВалютаПрайса,
|	ЦеныБазовые.Номенклатура,
|"+?(ЕстьХарактеристики,"
|	ЦеныБазовые.ХарактеристикаНоменклатуры,","")+"
|	МИНИМУМ(
|		ВЫБОР КОГДА ЦеныБазовые.ТипЦен.Рассчитывается ТОГДА
|			ЦеныРасчетные.ЕдиницаИзмерения
|		ИНАЧЕ
|			ЦеныБазовые.ЕдиницаИзмерения
|		КОНЕЦ
|	) КАК ЕдиницаИзмерения,
|	МИНИМУМ(ЦеныБазовые.Валюта
|	) КАК Валюта,
|	МИНИМУМ(
|			ЦеныБазовые.Цена
|	) КАК Цена

|ИЗ
|(ВЫБРАТЬ
|	СписокНоменклатуры.Номенклатура КАК Номенклатура,
|"+?(ЕстьХарактеристики,"
|	СписокНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,","")+"
|	СпрТипЦен.ТипЦен КАК ТипЦен,
|	ЦеныНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
|	ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) КАК Цена,
|	ВЫБОР КОГДА ЦеныНоменклатуры.Номенклатура ЕСТЬ NULL ТОГДА
|		СпрТипЦен.ПроцентСкидкиНаценки
|	ИНАЧЕ
|		ЕСТЬNULL(ЦеныНоменклатуры.ПроцентСкидкиНаценки, ЦеныНоменклатуры.ТипЦен.ПроцентСкидкиНаценки)
|	КОНЕЦ КАК ПроцентСкидкиНаценки,
|		ЕСТЬNULL(ЦеныНоменклатуры.Валюта, СпрТипЦен.Валюта) КАК Валюта
|	
|ИЗ
|	("+?(ЕстьХарактеристики,"ВЫБРАТЬ
|		СпрХарактеристики.Владелец КАК Номенклатура,
|		СпрХарактеристики.Ссылка КАК ХарактеристикаНоменклатуры
|	ИЗ Справочник.ХарактеристикиНоменклатуры КАК СпрХарактеристики
|	{ГДЕ СпрХарактеристики.Владелец.* КАК Номенклатура}
|	ОБЪЕДИНИТЬ ВСЕ","")+"
|	ВЫБРАТЬ
|		СпрНоменклатура.Ссылка как Номенклатура,
|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) как ХарактеристикаНоменклатуры
|	ИЗ Справочник.Номенклатура КАК СпрНоменклатура
|	{ГДЕ СпрНоменклатура.Ссылка.* КАК Номенклатура}
|	) КАК СписокНоменклатуры
|	СОЕДИНЕНИЕ
|	(ВЫБРАТЬ
|		СправочникЦен.Ссылка КАК ТипЦен,
|		СправочникЦен.ВалютаЦены КАК Валюта,
|		СправочникЦен.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки
|	//	СправочникЦен.СпособРасчетаЦены КАК СпособРасчетаЦены
|	ИЗ
|		Справочник.ТипыЦенНоменклатуры КАК СправочникЦен
|	{ГДЕ СправочникЦен.Ссылка.* КАК ТипЦен}
|	) КАК СпрТипЦен
|	ПО НЕ СписокНоменклатуры.Номенклатура.ЭтоГруппа
|	 И НЕ СписокНоменклатуры.Номенклатура.Набор
|	ЛЕВОЕ СОЕДИНЕНИЕ
|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата, {Номенклатура.* КАК Номенклатура,
|		ТипЦен.* КАК ТипЦен}) КАК ЦеныНоменклатуры
|	ПО ЦеныНоменклатуры.Номенклатура = СписокНоменклатуры.Номенклатура
|	И ЦеныНоменклатуры.ТипЦен = СпрТипЦен.ТипЦен
|"+?(ЕстьХарактеристики,"
|	И ЦеныНоменклатуры.ХарактеристикаНоменклатуры = СписокНоменклатуры.ХарактеристикаНоменклатуры","")+"
|	
|) КАК ЦеныБазовые
|ЛЕВОЕ СОЕДИНЕНИЕ
|РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата, {Номенклатура.* КАК Номенклатура}) КАК ЦеныРасчетные
|ПО ЦеныБазовые.Номенклатура = ЦеныРасчетные.Номенклатура
// 20.08.2018
|"+?(ЕстьХарактеристики,"
|И ЦеныБазовые.ХарактеристикаНоменклатуры = ЦеныРасчетные.ХарактеристикаНоменклатуры
|И ЦеныБазовые.ТипЦен.БазовыйТипЦен = ЦеныРасчетные.ТипЦен","")+"

|ГДЕ
|	НЕ ЦеныБазовые.ТипЦен.Рассчитывается
|	//ИЛИ ЦеныБазовые.СпособРасчетаЦены <> &СпособДиапазон
|	//ИЛИ (ЦеныБазовые.СпособРасчетаЦены = &СпособДиапазон И ЦеныРасчетные.Цена МЕЖДУ 0.000001 И ЦеныБазовые.ВерхняяГраница-0.000001)

|СГРУППИРОВАТЬ ПО
|	ЦеныБазовые.ТипЦен,
|//	ЦеныБазовые.ЦеноваяГруппа,
|	ЦеныБазовые.Номенклатура
// 20.08.2018
|"+?(ЕстьХарактеристики,"
|	,ЦеныБазовые.ХарактеристикаНоменклатуры","")+"
|) КАК ЗапросПрайс


|{ЛЕВОЕ //ОСТАТКИ
|СОЕДИНЕНИЕ
|(ВЫБРАТЬ
|	НесвернутыеОстатки.Номенклатура КАК НоменклатураОст,
|"+?(ЕстьХарактеристики,"
|	НесвернутыеОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатурыОст,","")+"
|	Сумма(НесвернутыеОстатки.Остаток) КАК Остаток
| ИЗ
|	(ВЫБРАТЬ
|		Ост.Номенклатура.Ссылка КАК Номенклатура,
|		Ост.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
|		Ост.КоличествоОстаток КАК Остаток
|	ИЗ
|		РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, {Склад.* КАК Склад,
|		   Номенклатура.* КАК Номенклатура}) КАК Ост
|		) КАК НесвернутыеОстатки
| СГРУППИРОВАТЬ ПО
|	НесвернутыеОстатки.Номенклатура,
|	НесвернутыеОстатки.ХарактеристикаНоменклатуры
|) КАК Остатки
|ПО
|	ЗапросПрайс.Номенклатура = Остатки.НоменклатураОст
|"+?(ЕстьХарактеристики,"
|	И ЗапросПрайс.ХарактеристикаНоменклатуры = Остатки.ХарактеристикаНоменклатурыОст","")+"

//+++ 11.08.2017 ---- штрихКоды
|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихКоды как ШтрихКоды
|ПО ЗапросПрайс.Номенклатура = ШтрихКоды.Владелец
|"+?(ЕстьХарактеристики,"
| и ЗапросПрайс.ХарактеристикаНоменклатуры = ШтрихКоды.ХарактеристикаНоменклатуры","")+"

|} //ОСТАТКИ
|СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата) КАК КурсыВалютСрезПоследних
|ПО ЗапросПрайс.Валюта = КурсыВалютСрезПоследних.Валюта //ЗАПРОСПРАЙСЦЕНА
//+++ 04.03.2015
|
|//СОЕДИНЕНИЯ
|
|{ГДЕ
|ИСТИНА КАК СвойстваИКатегории
|//СВОЙСТВА
|//КАТЕГОРИИ
|}
|УПОРЯДОЧИТЬ ПО
|	ЗапросПрайс.ТипЦен,
|	ЗапросПрайс.Номенклатура
|"+?(ЕстьХарактеристики,"
|	,ЗапросПрайс.ХарактеристикаНоменклатуры","")+"
|ИТОГИ МАКСИМУМ(Цена), МИНИМУМ(Валюта), МИНИМУМ(ЕдиницаИзмерения), МИНИМУМ(Остаток),
//11.08.2017
|		Максимум(ШтрихКод),

|	  МИНИМУМ(НетХарактеристик)//ИТОГИ
|ПО
|	ЗапросПрайс.ТипЦен,
|	ЗапросПрайс.Номенклатура
|"+?(ЕстьХарактеристики,"
|	,ЗапросПрайс.ХарактеристикаНоменклатуры","")+"
|//ОБЩИЕ_СВОЙСТВА
|АВТОУПОРЯДОЧИВАНИЕ";
	возврат текстЗапроса;
КонецФункции

// Заполняет построитель отчета.
//
Процедура ЗаполнитьПостроительОтчетаПоЦенамНоменклатуры() Экспорт

	ПостроительОтчета.Параметры.Вставить("Дата", КонецДня(ДатаПрайса));
	//ПостроительОтчета.Параметры.Вставить("СпособНаценка", Перечисления.СпособыРасчетаЦены.ПоПроцентнойНаценкеНаБазовыйТип);
	//ПостроительОтчета.Параметры.Вставить("СпособДиапазон", Перечисления.СпособыРасчетаЦены.ПоВхождениюБазовойЦеныВДиапазон);
	ПостроительОтчета.Параметры.Вставить("ВВалютеОтчета", ВВалютеОтчета);
	ПостроительОтчета.Параметры.Вставить("ВалютаОтчета", ВалютаОтчета);
	ПостроительОтчета.Параметры.Вставить("ПустаяСтрока", "");
	ПостроительОтчета.Параметры.Вставить("ДатаЦеныНеИзменились", КонецДня(ДатаЦеныНеИзменились));

//20.08.2018 - выключаем в запросе все "упонинания" о характеристике
ЕстьХарактеристики = константы.ИспользоватьХарактеристикиНоменклатуры.Получить(); 
ТекстЗапроса= получитьТекстЗапроса(ЕстьХарактеристики);

Если БезОтсутствующихВКомпании Тогда
ТекстЗапроса=СтрЗаменить(ТекстЗапроса,"{ЛЕВОЕ //ОСТАТКИ","ВНУТРЕННЕЕ");	
ТекстЗапроса=СтрЗаменить(ТекстЗапроса,"} //ОСТАТКИ","");
КонецЕсли;

Если БезПустыхЦен Тогда
	ТекстЗапроса=СтрЗаменить(ТекстЗапроса,"//ЗАПРОСПРАЙСЦЕНА","И ЗапросПрайс.Цена <> 0");
КонецЕсли;	

	// Соответствие имен полей в запросе и их представлений в отчете.
	Если Константы.ИспользоватьХарактеристикиНоменклатуры.Получить() тогда //20.08.2018
		СтруктураПредставлениеПолей = Новый Структура(
		"ТипЦен,    Номенклатура,   ХарактеристикаНоменклатуры ,   ЕдиницаИзмерения, Остаток, ШтрихКод",
		"Тип цен", "Номенклатура", "Характеристика номенклатуры", "Ед. измерения", "Остаток", "ШтрихКод"); //11.08.2017
	иначе  //без Характеристик
		СтруктураПредставлениеПолей = Новый Структура(
		"ТипЦен,    Номенклатура,  ЕдиницаИзмерения, Остаток, ШтрихКод",
		"Тип цен", "Номенклатура", "Ед. измерения", "Остаток", "ШтрихКод"); 
	КонецЕсли;

	ТекстПоляСвойств= "";
	ТекстПоляКатегорий = "";

	// Стандартный метод для использования в отчетах свойств и категорий.
	Если ИспользоватьСвойстваИКатегории Тогда
		ТаблицаПолей = Новый ТаблицаЗначений;
		ТаблицаПолей.Колонки.Добавить("ПутьКДанным");  // описание поля запроса поля, для которого добавляются свойства и категории. Используется в условии соединения с регистром сведений, хранящим значения свойств или категорий
		ТаблицаПолей.Колонки.Добавить("Представление");// представление поля, для которого добавляются свойства и категории. 
		ТаблицаПолей.Колонки.Добавить("Назначение");   // назначение свойств/категорий объектов для данного поля
		ТаблицаПолей.Колонки.Добавить("ТипЗначения");  // тип значения поля, для которого добавляются свойства и категории. Используется, если не установлено назначение
		ТаблицаПолей.Колонки.Добавить("НетКатегорий"); // признак НЕиспользования категорий для объекта

		СтрокаТаблицы = ТаблицаПолей.Добавить();
		СтрокаТаблицы.ПутьКДанным = "Номенклатура";
		СтрокаТаблицы.Представление = "Номенклатура";
		СтрокаТаблицы.Назначение = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура;
		
		Если Константы.ИспользоватьХарактеристикиНоменклатуры.Получить() тогда //20.08.2018 - свойсва характеристик НЕ нужны!
			СтрокаТаблицы = ТаблицаПолей.Добавить();
			СтрокаТаблицы.ПутьКДанным = "ХарактеристикаНоменклатуры";
			СтрокаТаблицы.Представление = "Характеристика номенклатуры";
			СтрокаТаблицы.Назначение = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ХарактеристикиНоменклатуры;
		КонецЕсли;
	
		ДобавитьВТекстСвойстваИКатегорииЛокально(ТаблицаПолей, ТекстЗапроса, СтруктураПредставлениеПолей, 
		ОбщийОтчет.мСоответствиеНазначений, ПостроительОтчета.Параметры
		,, ТекстПоляКатегорий, ТекстПоляСвойств,,,,,,ОбщийОтчет.мСтруктураДляОтбораПоКатегориям);

		Для Каждого ОтборПоКатегориям Из ОбщийОтчет.мСтруктураДляОтбораПоКатегориям Цикл
			ПостроительОтчета.Параметры.Вставить(ОтборПоКатегориям.Значение, ОтборПоКатегориям.Ключ);
		КонецЦикла;

		ДобавитьВТекстСВойстваОбщие(ТекстЗапроса, ТекстПоляСвойств, "//ОБЩИЕ_СВОЙСТВА");
	КонецЕсли;

	ПостроительОтчета.Текст = ТекстЗапроса;

	ПостроительОтчета.ЗаполнитьНастройки();

	// Создадим список полей, доступных для выбора.
	СоответствиеДоступныхПолей = Новый Соответствие;
	СоответствиеДоступныхПолей.Вставить("Валюта", 0);
	СоответствиеДоступныхПолей.Вставить("ЕдиницаИзмерения", 0);
	СоответствиеДоступныхПолей.Вставить("Остаток", 0);
	//СоответствиеДоступныхПолей.Вставить("ЦеноваяГруппа", 0);
	СоответствиеДоступныхПолей.Вставить("Номенклатура", 0);
	СоответствиеДоступныхПолей.Вставить("ХарактеристикаНоменклатуры", 0);
	//СоответствиеДоступныхПолей.Вставить("Стеллаж", 0);
	СоответствиеДоступныхПолей.Вставить("ШтрихКод", 0);//11.08.2017

	// Создадим список доступных отборов.
	СоответствиеДоступныхОтборов = Новый Соответствие;
	СоответствиеДоступныхОтборов.Вставить("Номенклатура", 0);
	СоответствиеДоступныхОтборов.Вставить("ТипЦен", 0);
	//СоответствиеДоступныхОтборов.Вставить("ЦеноваяГруппа", 0);

	СоответствиеДоступныхОтборов.Вставить("Склад", 0);
	СоответствиеДоступныхОтборов.Вставить("ВидСклада", 0);

	СоответствиеДоступныхОтборов.Вставить("ШтрихКод", 0);//11.08.2017
	// Отбор по валюте сделаем только,
	// если установлен флажок "Не включать по которым не заданы цены".
	Если БезПустыхЦен Тогда
		СоответствиеДоступныхОтборов.Вставить("Валюта", 0);
	КонецЕсли;

	Для Каждого ДоступноеПоле Из ПостроительОтчета.ДоступныеПоля Цикл
		Если СоответствиеДоступныхПолей[ДоступноеПоле.Имя] = Неопределено
		   И Найти(ДоступноеПоле.Имя, "Свойство") = 0
		   И Найти(ДоступноеПоле.Имя, "Категория") = 0 Тогда
			ДоступноеПоле.Поле = Ложь;
		Иначе
			ДоступноеПоле.Поле = Истина;
		КонецЕсли;

		Если СоответствиеДоступныхОтборов[ДоступноеПоле.Имя] <> Неопределено
		 Или Найти(ДоступноеПоле.Имя, "Свойство") <> 0
		 Или Найти(ДоступноеПоле.Имя, "Категория") <> 0 Тогда
			ДоступноеПоле.Отбор = Истина;
		Иначе
			ДоступноеПоле.Отбор = Ложь;
		КонецЕсли;
	КонецЦикла;

	ПостроительОтчета.ИзмеренияСтроки.Очистить();
	//ПостроительОтчета.ИзмеренияСтроки.Добавить("ЦеноваяГруппа", ,ТипИзмеренияПостроителяОтчета.Иерархия);
	ПостроительОтчета.ИзмеренияСтроки.Добавить("Номенклатура", ,ТипИзмеренияПостроителяОтчета.Иерархия);
	//ПостроительОтчета.ИзмеренияСтроки.Добавить("ХарактеристикаНоменклатуры");

	ПостроительОтчета.ИзмеренияКолонки.Очистить();
	ПостроительОтчета.ИзмеренияКолонки.Добавить("ТипЦен");

	ПостроительОтчета.ВыбранныеПоля.Очистить();
	ПостроительОтчета.ВыбранныеПоля.Добавить("Валюта");
	ПостроительОтчета.ВыбранныеПоля.Добавить("ЕдиницаИзмерения");

	ПостроительОтчета.Порядок.Очистить();
	ПостроительОтчета.Порядок.Добавить("ТипЦен");
	//ПостроительОтчета.Порядок.Добавить("ЦеноваяГруппа.Порядок");
	ПостроительОтчета.Порядок.Добавить("Номенклатура");
	//ПостроительОтчета.Порядок.Добавить("ХарактеристикаНоменклатуры");

	// Создадим массив отборов.
	МассивОтбора = Новый Массив;
	МассивОтбора.Добавить("Номенклатура");
	МассивОтбора.Добавить("ТипЦен");
	//МассивОтбора.Добавить("ЦеноваяГруппа");

	Для Каждого ЭлементОтбора Из МассивОтбора Цикл
		Если ПостроительОтчета.Отбор.Найти(ЭлементОтбора) = Неопределено Тогда
			ПостроительОтчета.Отбор.Добавить(ЭлементОтбора);
		КонецЕсли;
	КонецЦикла;

	Если ИспользоватьСвойстваИКатегории Тогда
		УстановитьТипыЗначенийСвойствИКатегорийДляОтбора(ПостроительОтчета, ТекстПоляКатегорий, ТекстПоляСвойств, ОбщийОтчет.мСоответствиеНазначений, СтруктураПредставлениеПолей);
	КонецЕсли;

	// Вызовем стандартную процедуру заполнения представлений.
	ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);

КонецПроцедуры // ЗаполнитьПостроительОтчетаПоЦенамНоменклатуры()

// Возвращает текстовое представление установленных отборов.
//
Функция ПолучитьТекстНастроекПостроителя()

	Результат = "";
	Для Каждого Отбор из ПостроительОтчета.Отбор Цикл
		Если Отбор.Использование Тогда
			Если Результат <> "" Тогда
				Результат = Результат + "
				|";
			Иначе
				Результат = НСтр("ru='Отбор:'") + "
				|";
			КонецЕсли;
			Результат = Результат + Отбор.Представление + " ";
			Если Отбор.ВидСравнения = ВидСравнения.Интервал Тогда
				Результат = Результат + НСтр("ru=' > '");
				Результат = Результат + Отбор.ЗначениеС;
				Результат = Результат + НСтр("ru=' И < '");
				Результат = Результат + Отбор.ЗначениеПо;
			ИначеЕсли Отбор.ВидСравнения = ВидСравнения.ИнтервалВключаяГраницы Тогда
				Результат = Результат + НСтр("ru=' >= '");
				Результат = Результат + Отбор.ЗначениеС;
				Результат = Результат + НСтр("ru=' И <= '");
				Результат = Результат + Отбор.ЗначениеПо;
			ИначеЕсли Отбор.ВидСравнения = ВидСравнения.ИнтервалВключаяНачало Тогда
				Результат = Результат + НСтр("ru=' >= '");
				Результат = Результат + Отбор.ЗначениеС;
				Результат = Результат + НСтр("ru=' И < '");
				Результат = Результат + Отбор.ЗначениеПо;
			ИначеЕсли Отбор.ВидСравнения = ВидСравнения.ИнтервалВключаяОкончание Тогда
				Результат = Результат + НСтр("ru=' > '");
				Результат = Результат + Отбор.ЗначениеС;
				Результат = Результат + НСтр("ru=' И <= '");
				Результат = Результат + Отбор.ЗначениеПо;
			ИначеЕсли Отбор.ВидСравнения = ВидСравнения.ВСписке
				Или Отбор.ВидСравнения = ВидСравнения.ВСпискеПоИерархии
				Или Отбор.ВидСравнения = ВидСравнения.НеВСписке
				Или Отбор.ВидСравнения = ВидСравнения.НеВСпискеПоИерархии Тогда
				Результат = Результат + Отбор.ВидСравнения + " (" + Отбор.Значение + ")";
			Иначе
				Результат = Результат + Отбор.ВидСравнения + " " + Отбор.Значение;
			КонецЕсли;
			Результат = Результат + ";";
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции // ПолучитьТекстНастроекПостроителя()

// Производит рекурсивный обход выборки,
// выводит в макет строки прайса из текущей выборки.
//
//  Параметры:
//   Выборка - текущая выборка.
//   НомерГруппировки - текущий номер группировки строк.
//
Процедура ВывестиСтрокуПрайса(Выборка, НомерГруппировки, КолонкиРезультата)

	// Обойдем в цикле переданную выборку.
	Пока Выборка.Следующий() Цикл
		Уровень = Выборка.Уровень();
		ЭтоНеИтогПоИерархии = (Выборка.ТипЗаписи() <> ТипЗаписиЗапроса.ИтогПоИерархии);
		НазваниеГруппировки = Выборка.Группировка();
		ЭтоНижнийУровень = (((мНетХарактеристик Или Выборка.НетХарактеристик)
		                   И НазваниеГруппировки = "Номенклатура" И ЭтоНеИтогПоИерархии)
		                   Или НазваниеГруппировки = "ХарактеристикаНоменклатуры");

		ЗначениеГруппировки = Выборка[НазваниеГруппировки];

		Если ЗначениеГруппировки = мПустаяХарактеристика Тогда
			ПредставлениеГруппировки = "----//----";//Пустую характеристику будем выводить так.
		Иначе
			Если КолонкиРезультата.Найти(НазваниеГруппировки + "Представление") = Неопределено Тогда
				ПредставлениеГруппировки = Выборка[НазваниеГруппировки];
			Иначе
				ПредставлениеГруппировки = Выборка[НазваниеГруппировки + "Представление"];
			КонецЕсли;
		КонецЕсли;

		// Если тип записи - это итог по иерархии,
		// то для вывода будем использовать секции, предназначенные для иерархии.
		Если ЭтоНеИтогПоИерархии Тогда
			СекцияНачало = мСписокНачало;
			СекцияНоменклатура = мСписокНоменклатура;
			СекцияТипЦен = мСписокТипЦен;
			СекцияОстаток = мСписокОстаток;
			СекцияДопПоле = мСписокДопПоле;
		Иначе
			СекцияНачало = мСписокГруппаНачало;
			СекцияНоменклатура = мСписокГруппаНоменклатура;
			СекцияТипЦен = мСписокГруппаТипЦен;
			СекцияОстаток = мСписокГруппаОстаток;
			СекцияДопПоле = мСписокГруппаДопПоле;
		КонецЕсли;

		// Если установлен флажок раскраски группировок,
		// то раскрасим их в зависимости от уровня группировки и признака разворачивания.
		Если ОтображатьИерархиюВЦвете Тогда
			Если ЭтоНижнийУровень Тогда
				ЦветФона = мСоответствиеЦветовИерархии[6];
			Иначе
				ЦветФона = мСоответствиеЦветовИерархии[Мин(Уровень + 1, 6)];
			КонецЕсли;

			СекцияНоменклатура.Область(1, 1, 1, 1).ЦветФона = ЦветФона;
			СекцияТипЦен.Область(1, 1, 1, мКоличествоКолонокВТипеЦен).ЦветФона = ЦветФона;

			Если мЕстьОстаток Тогда
				СекцияОстаток.Область(1, 1, 1, 1).ЦветФона = ЦветФона;
			КонецЕсли;

			Если мКоличествоДопПолейПосле + мКоличествоДопПолейДо > 0 Тогда
				СекцияДопПоле.Область(1, 1, 1, 1).ЦветФона = ЦветФона;
			КонецЕсли;
		КонецЕсли;

		мТабДок.Вывести(СекцияНачало, Уровень, , Истина);

		// Сформируем строку с пробелами для организации отступов вывода группировок.
		Пробелы = "";
		Для Тмп = 1 По Уровень Цикл
			Пробелы = Пробелы + "    ";
		КонецЦикла;

		СекцияНоменклатура.Параметры.Измерение = Пробелы + ПредставлениеГруппировки;

		Если ЭтоНеИтогПоИерархии Тогда
			СекцияНоменклатура.Параметры.Расшифровка = ЗначениеГруппировки;
		КонецЕсли;

		// Если выведены все группировки верхних уровней,
		// то выведем остаток, доп. поля, цены.
		Если ЭтоНижнийУровень Тогда
			Для Тмп = 1 По мКоличествоДопПолейДо Цикл
				СекцияДопПоле.Параметры.ЗначениеДопПоля = Выборка[мСоответствиеДопПолейДо[Тмп]];
				мТабДок.Присоединить(СекцияДопПоле);
			КонецЦикла;

			СтрокаДопПолейВместе = "";
			Для Тмп = 1 По мКоличествоДопПолейВместе Цикл
				Если Не ПустаяСтрока(Строка(Выборка[мСоответствиеДопПолейВместе[Тмп]])) Тогда
					Если ПустаяСтрока(СтрокаДопПолейВместе) Тогда
						СтрокаДопПолейВместе = СтрокаДопПолейВместе + " (" + Выборка[мСоответствиеДопПолейВместе[Тмп]];
					Иначе
						СтрокаДопПолейВместе = СтрокаДопПолейВместе + ", " + Выборка[мСоответствиеДопПолейВместе[Тмп]];
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;

			Если Не ПустаяСтрока(СтрокаДопПолейВместе) Тогда
				СекцияНоменклатура.Параметры.Измерение = СекцияНоменклатура.Параметры.Измерение + СтрокаДопПолейВместе + ")";
			КонецЕсли;

			мТабДок.Присоединить(СекцияНоменклатура);

			Если мЕстьОстаток Тогда
				СекцияОстаток.Параметры.Остаток = Формат(Выборка.Остаток, "ЧЦ=15; ЧДЦ=3");
				мТабДок.Присоединить(СекцияОстаток);
			КонецЕсли;

			Для Тмп = 1 По мКоличествоДопПолейПосле Цикл
				СекцияДопПоле.Параметры.ЗначениеДопПоля = Выборка[мСоответствиеДопПолейПосле[Тмп]];
				мТабДок.Присоединить(СекцияДопПоле);
			КонецЦикла;

			ВыборкаТипЦен = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ТипЦен", "Все");
			Пока ВыборкаТипЦен.Следующий() Цикл
				Если ЗначениеЗаполнено(ВыборкаТипЦен.Цена) Тогда
					СтрВалюта = ?(мЕстьВалюта, " " + ВыборкаТипЦен.Валюта, "");

					СекцияТипЦен.Параметры.Цена = ФорматСумм(ОкруглитьЦену(ВыборкаТипЦен.Цена, ВыборкаТипЦен.ПорядокОкругления, ВыборкаТипЦен.ОкруглятьВБольшуюСторону)) + СтрВалюта;
				Иначе
					СекцияТипЦен.Параметры.Цена = "";
				КонецЕсли;

				Если мЕстьЕдиница Тогда
					СекцияТипЦен.Параметры.Единица = ВыборкаТипЦен.ЕдиницаИзмерения;
				КонецЕсли;

				мТабДок.Присоединить(СекцияТипЦен);
			КонецЦикла;
		Иначе

			// Для группировок верхних уровней и иерархии выведем
			// пустые ячейки остатка, доп. полей и цен.
			Для Тмп = 1 По мКоличествоДопПолейДо Цикл
				СекцияДопПоле.Параметры.ЗначениеДопПоля = "";
				мТабДок.Присоединить(СекцияДопПоле);
			КонецЦикла;

			мТабДок.Присоединить(СекцияНоменклатура);

			Если мЕстьОстаток Тогда
				СекцияОстаток.Параметры.Остаток = "";
				мТабДок.Присоединить(СекцияОстаток);
			КонецЕсли;

			Для Тмп = 1 По мКоличествоДопПолейПосле Цикл
				СекцияДопПоле.Параметры.ЗначениеДопПоля = "";
				мТабДок.Присоединить(СекцияДопПоле);
			КонецЦикла;

			Для Тмп = 1 По мКоличествоТиповЦен Цикл
				СекцияТипЦен.Параметры.Цена = "";

				Если мЕстьЕдиница Тогда
					СекцияТипЦен.Параметры.Единица = "";
				КонецЕсли;

				мТабДок.Присоединить(СекцияТипЦен);
			КонецЦикла;

			// Если тип записи не итог по иерархии,
			// то нужно выбрать следующую группировку.
			Если ЭтоНеИтогПоИерархии Тогда
				ВывестиСтрокуПрайса(Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, мСоответствиеГруппировок[НомерГруппировки + 1]), НомерГруппировки + 1, КолонкиРезультата);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ВывестиСтрокуПрайса()

// Выполняет запрос и формирует прайс-лист в соответствии с установленными настройками
//
// Параметры:
// ДокументРезультат - табличный документ, формируемый отчетом.
//
Процедура ПечатьПрайсЛиста(ДокументРезультат) Экспорт

	РезультатЗапроса = ВыполнитьЗапрос(Новый Структура("НетХарактеристик, ПорядокОкругления, ОкруглятьВБольшуюСторону, Цена"));

	мТабДок = ДокументРезультат;

	мТабДок.Очистить();

	Макет = ЭтотОбъект.ПолучитьМакет("МакетПрайса");

	// Выведем заголовок прайса.
	Секция = Макет.ПолучитьОбласть("Заголовок");
	Секция.Параметры.Организация = Организация;
	Секция.Параметры.Валюта = ?(ВВалютеОтчета, "В валюте: " + ВалютаОтчета + " (курс " + Окр(ПолучитьКурсВалюты(ВалютаОтчета, ДатаПрайса).Курс, 2) + ").", "В валютах цен.");
	Секция.Параметры.Период = "Цены указаны на "+ Формат(ДатаПрайса, "ДФ = ""дд.ММ.гггг""");
	Секция.Параметры.Отбор = ?(ОтображатьСтрокуОтбора, ПолучитьТекстНастроекПостроителя(), "");
	мТабДок.Вывести(Секция);

	// Заполним флаги, показывающие наличие особых полей и группировок.
	СтрокаНастройки = ТаблицаНастройкиПолейПечать.Найти("Валюта", "Имя");
	мЕстьВалюта = ?(СтрокаНастройки <> Неопределено И СтрокаНастройки.ВыводитьНаПечать, Истина, Ложь);

	СтрокаНастройки = ТаблицаНастройкиПолейПечать.Найти("ЕдиницаИзмерения", "Имя");
	мЕстьЕдиница = ?(СтрокаНастройки <> Неопределено И СтрокаНастройки.ВыводитьНаПечать, Истина, Ложь);

	СтрокаНастройки = ТаблицаНастройкиПолейПечать.Найти("Остаток", "Имя");
	мЕстьОстаток = ?(СтрокаНастройки <> Неопределено И СтрокаНастройки.ВыводитьНаПечать, Истина, Ложь);

	мНетХарактеристик = (ПостроительОтчета.ИзмеренияСтроки.Найти("ХарактеристикаНоменклатуры") = Неопределено);

	Секция = Макет.ПолучитьОбласть("Шапка|Начало");
	мТабДок.Вывести(Секция);

	Секция = Макет.ПолучитьОбласть("Шапка|ДопПоле");

	мКоличествоДопПолейДо = 0;
	мСоответствиеДопПолейДо = Новый Соответствие;

	// Выведем доп. поля, которые нужно выводить ДО номенклатуры, в шапку.
	// Заодно посчитаем их количество и запомним соответствие имен.
	Для Каждого ДопПоле Из ТаблицаНастройкиПолейПечать Цикл
		Если ДопПоле.ВыводитьНаПечать И ДопПоле.Положение = "В отдельной колонке до номенклатуры" Тогда
			мКоличествоДопПолейДо = мКоличествоДопПолейДо + 1;
			мСоответствиеДопПолейДо.Вставить(мКоличествоДопПолейДо, ДопПоле.Имя);

			Секция.Параметры.ДопПоле = ДопПоле.Псевдоним;
			мТабДок.Присоединить(Секция);
		КонецЕсли;
	КонецЦикла;

	мКоличествоДопПолейВместе = 0;
	мСоответствиеДопПолейВместе = Новый Соответствие;

	// Посчитаем количество доп. полей, которые должны выводиться вместе с номенклатурой
	// и запомним соответствие имен.
	Для Каждого ДопПоле Из ТаблицаНастройкиПолейПечать Цикл
		Если ДопПоле.ВыводитьНаПечать И ДопПоле.Положение = "Вместе с номенклатурой" Тогда
			мКоличествоДопПолейВместе = мКоличествоДопПолейВместе + 1;
			мСоответствиеДопПолейВместе.Вставить(мКоличествоДопПолейВместе, ДопПоле.Имя);
		КонецЕсли;
	КонецЦикла;

	мКоличествоГруппировок = - 1;
	мСоответствиеГруппировок = Новый Соответствие;

	// Сформируем строку группировок.
	// Заодно посчитаем их количество и запомним соответствие имен.
	ТекстГруппировок = "";
	Для Каждого ГруппировкаСтрок Из ПостроительОтчета.ИзмеренияСтроки Цикл
		мКоличествоГруппировок = мКоличествоГруппировок + 1;
		мСоответствиеГруппировок.Вставить(мКоличествоГруппировок, ГруппировкаСтрок.Имя);

		ТекстГруппировок = ТекстГруппировок + ГруппировкаСтрок.Представление + "/ ";
	КонецЦикла;

	Секция = Макет.ПолучитьОбласть("Шапка|Номенклатура");
	Секция.Параметры.ГруппировкиСтрок = Лев(ТекстГруппировок, СтрДлина(ТекстГруппировок) - 2);
	мТабДок.Присоединить(Секция);

	// Если на странице "Поля" выбран Остаток,
	// то выведем его в шапку первым из доп. полей.
	Если мЕстьОстаток Тогда
		Секция = Макет.ПолучитьОбласть("Шапка|Остаток");
		мТабДок.Присоединить(Секция);
	КонецЕсли;

	Секция = Макет.ПолучитьОбласть("Шапка|ДопПоле");

	мКоличествоДопПолейПосле = 0;
	мСоответствиеДопПолейПосле = Новый Соответствие;

	// Выведем доп. поля, которые нужно выводить ПОСЛЕ номенклатуры, в шапку.
	// Заодно посчитаем их количество и запомним соответствие имен.
	Для Каждого ДопПоле Из ТаблицаНастройкиПолейПечать Цикл
		Если ДопПоле.ВыводитьНаПечать И ДопПоле.Положение = "В отдельной колонке после номенклатуры" Тогда
			мКоличествоДопПолейПосле = мКоличествоДопПолейПосле + 1;
			мСоответствиеДопПолейПосле.Вставить(мКоличествоДопПолейПосле, ДопПоле.Имя);

			Секция.Параметры.ДопПоле = ДопПоле.Псевдоним;
			мТабДок.Присоединить(Секция);
		КонецЕсли;
	КонецЦикла;

	// Если в доп. полях выбрана единица,
	// то будем выводить колонки типов цен с единицей,
	// иначе - будем выводить колонки без единицы.
	Если мЕстьЕдиница Тогда
		Секция = Макет.ПолучитьОбласть("Шапка|ТипЦенСЕдиницей");
	Иначе
		Секция = Макет.ПолучитьОбласть("Шапка|ТипЦен");
	КонецЕсли;

	мКоличествоТиповЦен = 0;

	// Выведем типы цен в шапку.
	// Заодно посчитаем их количество.
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ТипЦен", "Все");
	Пока Выборка.Следующий() Цикл
		мКоличествоТиповЦен = мКоличествоТиповЦен + 1;

		Секция.Параметры.ТипЦен = Выборка.ТипЦенПредставление;
		Секция.Параметры.Расшифровка = Выборка.ТипЦен;
		мТабДок.Присоединить(Секция);
	КонецЦикла;

	мКоличествоКолонокВТипеЦен = ?(мЕстьЕдиница, 2, 1);

	мСоответствиеЦветовИерархии = Новый Соответствие;

	// Запомним соответствие цветов для раскраски.
	Для Тмп = 1 По 6 Цикл
		мСоответствиеЦветовИерархии.Вставить(Тмп, Макет.ПолучитьОбласть("Цвет" + Тмп).Область(1, 1, 1, 1).ЦветФона);
	КонецЦикла;

	мПустаяХарактеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();

	мСписокНачало = Макет.ПолучитьОбласть("Список|Начало");
	мСписокНоменклатура = Макет.ПолучитьОбласть("Список|Номенклатура");
	Если мЕстьЕдиница Тогда
		мСписокТипЦен = Макет.ПолучитьОбласть("Список|ТипЦенСЕдиницей");
	Иначе
		мСписокТипЦен = Макет.ПолучитьОбласть("Список|ТипЦен");
	КонецЕсли;
	мСписокОстаток = Макет.ПолучитьОбласть("Список|Остаток");
	мСписокДопПоле = Макет.ПолучитьОбласть("Список|ДопПоле");

	мСписокГруппаНачало = Макет.ПолучитьОбласть("СписокГруппа|Начало");
	мСписокГруппаНоменклатура = Макет.ПолучитьОбласть("СписокГруппа|Номенклатура");
	Если мЕстьЕдиница Тогда
		мСписокГруппаТипЦен = Макет.ПолучитьОбласть("СписокГруппа|ТипЦенСЕдиницей");
	Иначе
		мСписокГруппаТипЦен = Макет.ПолучитьОбласть("СписокГруппа|ТипЦен");
	КонецЕсли;
	мСписокГруппаОстаток = Макет.ПолучитьОбласть("СписокГруппа|Остаток");
	мСписокГруппаДопПоле = Макет.ПолучитьОбласть("СписокГруппа|ДопПоле");

	мТабДок.НачатьАвтогруппировкуСтрок();
	ВывестиСтрокуПрайса(РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, мСоответствиеГруппировок[0]), 0, РезультатЗапроса.Колонки);
	мТабДок.ЗакончитьАвтогруппировкуСтрок();

	мТабДок.ФиксацияСверху = 10;
	мТабДок.ФиксацияСлева = мКоличествоДопПолейДо + 2;

КонецПроцедуры // ПечатьПрайсЛиста()
#КонецЕсли
